{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"02.control_structures_part_1.ipynb","provenance":[],"collapsed_sections":[],"authorship_tag":"ABX9TyP3H9ZiDgFhh5b1O0cDc04i"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["Задание 1. Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n","\n","среднюю букву, если число букв в слове нечетное;\n","две средних буквы, если число букв четное.\n"],"metadata":{"id":"gtsyNnc4tElO"}},{"cell_type":"code","execution_count":null,"metadata":{"id":"5_ntS5iss71C"},"outputs":[],"source":["def mid_letter_output():\n","    input_word = input(\"Введите пожалуйста слово: \")\n","    len_input_word = len(input_word) / 2\n","    if len(input_word) % 2 == 0:\n","        print(input_word[int(len_input_word - 1)] + input_word[int(len_input_word)])\n","    elif len(input_word) % 2 != 0 and len(input_word) > 1:\n","        print(input_word[int(len_input_word - 0.5)])\n","    else:\n","        print(input_word)"]},{"cell_type":"code","source":["mid_letter_output()"],"metadata":{"id":"FGzj4y_6tPUI"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Задание 2. Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел."],"metadata":{"id":"RAtuxhpNtT21"}},{"cell_type":"code","source":["def sum_of_input_numbers():\n","    input_number = int(input(\"Введите число: \"))\n","    input_arr = []\n","\n","    while input_number != 0:\n","        input_arr.append(input_number)\n","        input_number = int(input(\"Введите число: \"))\n","\n","    input_sum = sum(input_arr)\n","    print(f'Сумма введенных чисел равна {input_sum}')"],"metadata":{"id":"VM5gfSDOtXWg"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["sum_of_input_numbers()"],"metadata":{"id":"ZnrXpIyetbAQ"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Задание 3. Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\n","Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:"],"metadata":{"id":"9vpQQg-xtdSh"}},{"cell_type":"code","source":["def dating_mvp(boys: [str], girls: [str]):\n","    if len(boys) == len(girls):\n","        boys.sort()\n","        girls.sort()\n","        print('Идеальные пары:')\n","        for b, g in zip(boys, girls):\n","            print(boys.index(b) + 1, b, ' и ', g)\n","    else:\n","        print('Внимание, кто-то может остаться без пары')"],"metadata":{"id":"z0rw-RWLtgig"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["dating_mvp(['Peter', 'Alex', 'John', 'Arthur', 'Richard'], ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha'])"],"metadata":{"id":"U2PsLhnPtuHO"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Задание 4.\n","У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны."],"metadata":{"id":"JpHAJy_Ttzo4"}},{"cell_type":"code","source":["def mid_temperature(countries_temperature: []):\n","    countries_mid_temp_celcius = []\n","    for ct in countries_temperature:\n","        countries_mid_temp_celcius.append(\n","            [ct[0], round(((sum(ct[1]) / len(ct[1]) - 32) / 1.8), 1)]\n","        )\n","    print('Средняя температура в странах:')\n","    for cel in countries_mid_temp_celcius:\n","        print(countries_mid_temp_celcius.index(cel) + 1, cel[0], '-', cel[1])"],"metadata":{"id":"J8GZ6peet3vK"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["mid_temperature([\n","    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n","    ['Germany', [57.2, 55.4, 59, 59, 53.6]],\n","    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n","    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n","])"],"metadata":{"id":"8hvnyTOcuDDU"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Задание 5.\n","Дан поток логов по количеству просмотренных страниц для каждого пользователя. Вам необходимо написать алгоритм, который считает среднее значение просмотров на пользователя. Т. е. надо посчитать отношение суммы всех просмотров к количеству уникальных пользователей."],"metadata":{"id":"4zdhYJHsuNLh"}},{"cell_type":"code","source":["def user_views_average(stream: []):\n","    count = []\n","    users = []\n","    for st in stream:\n","        count.append(\n","            int(st.split(',')[2])\n","        )\n","        users.append(\n","            st.split(',')[1]\n","        )\n","    users = set(users)\n","    views_average = round((sum(count) / len(users)), 2)\n","\n","    print(f'Среднее количество просмотров на уникального пользователя: {views_average}')"],"metadata":{"id":"-2tTyTE9uRvk"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["stream_log = stream = [\n","    '2018-01-01,user1,3',\n","    '2018-01-07,user1,4',\n","    '2018-03-29,user1,1',\n","    '2018-04-04,user1,13',\n","    '2018-01-05,user2,7',\n","    '2018-06-14,user3,4',\n","    '2018-07-02,user3,10',\n","    '2018-03-21,user4,19',\n","    '2018-03-22,user4,4',\n","    '2018-04-22,user4,8',\n","    '2018-05-03,user4,9',\n","    '2018-05-11,user4,11',\n","]\n","\n","user_views_average(stream_log)"],"metadata":{"id":"9Pf4Fj8AubDt"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["Задание 6.\n","Необходимо у пользователя запрашивать набор чисел разделенных пробелом. В результате в отсортированном порядке должны выводиться числа, которые повторяются в вводе более одного раза."],"metadata":{"id":"U60oXBbIuiAR"}},{"cell_type":"code","source":["def repeating_int_output():\n","    input_arr = input('Введите числа через пробел: ').split(' ')\n","    dnstr = str()\n","    for ia in range(len(input_arr)):\n","        input_arr[ia] = int(input_arr[ia])\n","    visited = set()\n","    duplicate_nums = list({x for x in input_arr if x in visited or (visited.add(x) or False)})\n","    duplicate_nums.sort()\n","    for dn in duplicate_nums:\n","        dnstr += str(dn) + ' '\n","    print(dnstr)"],"metadata":{"id":"mmT_vMeuunu1","executionInfo":{"status":"ok","timestamp":1660134580141,"user_tz":-660,"elapsed":8,"user":{"displayName":"Marat Galiulin","userId":"03244701117284584326"}}},"execution_count":2,"outputs":[]},{"cell_type":"code","source":["repeating_int_output()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"_GqJ3GZ3uvTf","executionInfo":{"status":"ok","timestamp":1660134598391,"user_tz":-660,"elapsed":16212,"user":{"displayName":"Marat Galiulin","userId":"03244701117284584326"}},"outputId":"a6542939-c982-4d76-c240-3d9b19d56d11"},"execution_count":3,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите числа через пробел: 1 2 1 3 2 54 1 45 45 54\n","1 2 45 54 \n"]}]},{"cell_type":"code","source":[""],"metadata":{"id":"zYZBfIT3u9Wc"},"execution_count":null,"outputs":[]}]}