def morse_code_interpreter():
    morse = {'А': '·−', 'Б': '−···', 'В': '·−−', 'Г': '−−·', 'Д': '−··', 'Е': '·', 'Ж': '···−', 'З': '−−··', 'И': '··',
             'Й': '·−−−', 'К': '−·−', 'Л': '·−··', 'М': '−−', 'Н': '−·', 'О': '−−−', 'П': '·−−·', 'Р': '·−·',
             'С': '···',
             'Т': '−', 'У': '··−', 'Ф': '··−·', 'Х': '····', 'Ц': '−·−·', 'Ч': '−−−·', 'Ш': '−−−−', 'Щ': '−−·−',
             'Ъ': '·−−·−·', 'Ы': '−·−−', 'Ь': '−··−', 'Э': '··−··', 'Ю': '··−−', 'Я': '·−·−'}
    text = 'Я умею программировать'
    string = ''
    for letter in text:
        letter = letter.upper()
        if letter in morse:
            string += morse[letter]
        elif letter == ' ':
            string += ' '
        else:
            string = ''
            print('Произошла ошибка')
            break
    print(string)


morse_code_interpreter()